sirikiakhil/STM32_BareMetal_Practice/EXTI__1/Core/Src/main.c
/*
 * Button interrupt (EXTI) to toggle LED
 */

#include "stm32f4xx.h"

static void gpio_config(void);
static void EXTI_config(void);
static void NVIC_config(void);

int main(void)
{
	gpio_config();
	EXTI_config();
	while(1);
}

static void gpio_config(void)
{
	    // GPIOA is on AHB1 bus
		RCC->AHB1ENR |=RCC_AHB1ENR_GPIOAEN ;      //Enableing the clock for GPIO

		// GPIOC is on AHB1 bus
		RCC->AHB1ENR |=RCC_AHB1ENR_GPIOCEN ;      //Enableing the clock for GPIOA
		(void)RCC->AHB1ENR;                       // read-back to ensure clock is active
		//-------------------------------------

		GPIOA->MODER &= ~(3U << 10);             //Clearing the moder PA5 bits
		GPIOA->MODER |= (1U << 10);              // setting the moder  PA5 bits as output configuration

		GPIOA->OTYPER &= ~(1U << 5);               //Push -Pull type

		GPIOA->OSPEEDR &= ~(3U << 10);           //Clearing the output speed PA5 bits

		GPIOA->PUPDR &= ~(3U << 10);            //Clearing the PA5 PUPDR bits
		//--------------------------------------

		GPIOC->MODER &= ~(3U << 26);             //Clearing the moder PC13 bits to config as input mode

		GPIOC->OSPEEDR &= ~(3U << 26);           //Clearing the output speed PC13 bits to set  low speed

		GPIOC->PUPDR &= ~(3U << 26);            //Clearing the PC13 PUPDR bits
		GPIOC->PUPDR |= (1U << 26);             // config as pull-up

}

static void EXTI_config(void)
{
	//Enabling clock for sysconfig
	RCC->APB2ENR |= (1U << 14);
	(void)RCC->APB2ENR;               // read-back to ensure clock is active

	//configuring EXTI13 to GPIOC13
	SYSCFG->EXTICR[3] &= ~(15U << 4);
	SYSCFG->EXTICR[3] |= (2U << 4);  /*Reference Manual      C Array

                                        names                but memory
                                       EXTICR1  ---------->  EXTICR[0]
                                       EXTICR2  ---------->  EXTICR[1]
                                       EXTICR3  ---------->  EXTICR[2]
                                       EXTICR4  ---------->  EXTICR[3] */

	//Enabling the 13 line of EXTI
	EXTI->IMR |= (1U << 13);

	//detecting the falling edge
	EXTI->FTSR |= (1U << 13);       //interrput occurs at falling edge
	NVIC_config();
}

static void NVIC_config(void)
{
	//settting the EXTI13 line interrput
	NVIC->ISER[1] |= (1U << 8);

	//setting the priority for EXTI13
	NVIC->IP[40] |= (1U << 4);

}

void EXTI15_10_IRQHandler(void)
{
	GPIOA->ODR ^= (1U << 5);

	//clearinf the pending EXTI Pending flag
	EXTI->PR |= (1U << 13);
}
